app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`login` = 'ian') LIMIT 1
SELECT * FROM `words` WHERE (`words`.user_id = 1) ORDER BY words.id DESC LIMIT 0, 10
---
     def show
       #@user = current_user
	   @user = User.find_by_login(params[:id])
	   @words_submitted = @user.words.paginate(:all,
			:limit => 20, :order => 'words.id DESC', :per_page =>10, :page => params[:page])

INSERT INTO `users` (`salt`, `name`, `updated_at`, `activated_at`, `photo_file_name`, `photo_file_size`, `crypted_password`, `remember_token_expires_at`, `activation_code`, `photo_updated_at`, `password_reset_code`, `enabled`, `photo_content_type`, `remember_token`, `identity_url`, `bio`, `login`, `web`, `email`, `created_at`, `location`) VALUES('005e591834662442ee64de4a50de55f0ef218d49', NULL, '2009-01-24 05:52:31', NULL, NULL, NULL, 'bcaf7fe2d24e4657e3f3b4193f15ecab420a15e6', NULL, '9865e39d072be72081aab7909e4c8f20b56c2bd8', NULL, NULL, 1, NULL, NULL, NULL, NULL, 'baller', NULL, 'baller@mailinator.com', '2009-01-24 05:52:31', NULL)
---
	def create
		@user = User.new(params[:user])
		if verify_recaptcha && @user.errors.empty? && @user.save

UPDATE `users` SET `photo_updated_at` = '2009-01-20 18:29:39', `updated_at` = '2009-01-20 18:29:44' WHERE `id` = 1
---
     def update
       @user = current_user
	     @user.photo = params[:user][:photo]
	     if @user.update_attributes(:name  => params[:user][:name], :location => params[:user][:location], :web => params[:user][:web],
					:bio  => params[:user][:bio])