app/controllers/votes_controller.rb

  def create
	@word = Word.find(params[:word_id])
	@word.votes.create!(:user => @current_user)
---
SELECT * FROM `words` WHERE (`words`.`id` = 3)
INSERT INTO `votes` (`updated_at`, `user_id`, `word_id`, `created_at`) VALUES('2009-01-24 05:55:44', 2, 3, '2009-01-24 05:55:44')