app/controllers/words_controller.rb

INSERT INTO `words` (`updated_at`, `photo_file_name`, `photo_file_size`, `language`, `delta`, `word`, `example`, `votes_count`, `photo_updated_at`, `photo_content_type`, `definition`, `user_id`, `created_at`) VALUES('2009-01-20 19:30:35', 'social.jpg', 33565, 'english/technology', 1, 'social media', 'sadasdasd', 0, '2009-01-20 19:30:18', 'image/jpeg', 'Internet and mobile-based websites and applications that allow people to communicate and share information and media.', 1, '2009-01-20 19:30:35')
---
  def create
	  @word = @current_user.words.build params[:word]
    if verify_recaptcha && @word.save

SELECT * FROM `words` WHERE (`words`.`id` = 4)
UPDATE `words` SET `word` = '4 - social media - edited for real!!!', `updated_at` = '2009-01-25 20:17:38' WHERE `id` = 4
---
  def update
    @word = Word.find(params[:id])
    if verify_recaptcha && @word.update_attributes(params[:word])

SELECT * FROM `words` WHERE (`words`.`id` = 3)
---
  def edit
    @word = Word.find(params[:id])

SELECT * FROM `words` WHERE (`words`.`id` = 1)
---
  def show
	  unless read_fragment({:id => params[:id]})  # Add the id param to the cache naming
		  @word = Word.find(params[:id])